<template>
  <div class="agreement_page">
    <div class="agreement_content">
      <h1>用户登录协议</h1>
      <br>
      <p>欢迎使用我们的服务！在您使用我们的服务之前，请仔细阅读以下用户登录协议。通过登录，您表示您已经阅读、理解并同意遵守本协议中规定的所有条款和条件。如果您不同意本协议的任何部分，请不要继续使用我们的服务。</p>
      <h2>账户注册</h2>
      <p>1.1 您可以注册一个用户账户以使用我们的服务。您必须提供准确、完整和当前的个人信息，并及时更新这些信息。您的个人信息将受到我们的隐私政策保护。</p>
      <p>1.2 您的账户仅供个人使用，您不得将您的账户信息分享或转让给其他人。</p>
      <p>1.3 您将对使用您的账户进行的所有活动和行为负全部责任。</p>
      <h2>用户责任</h2>
      <p>2.1 您承诺不会使用我们的服务进行非法活动，包括但不限于：</p>
      <p>2.1.1 欺诈行为、盗窃、仿冒或侵犯他人知识产权；</p>
      <p>2.1.2 发布违法、淫秽、诋毁、威胁或骚扰性内容；</p>
      <p>2.1.3 破坏、干扰或滥用我们的系统或网络安全；</p>
      <p>2.1.4 散布病毒、恶意软件或其他有害的技术；</p>
      <p>2.1.5 未经授权访问其他用户的账户或获取他人的个人信息；</p>
      <p>2.1.6 其他违法或违反道德规范的行为。</p>
      <p>2.2 您应妥善保管您的登录信息，不得与他人共享，以确保您的账户安全。</p>
      <p>2.3 您应遵守所有适用的法律法规，包括但不限于个人隐私、数据保护和版权法。</p>
      <h2>修改和终止</h2>
      <p>3.1 我们有权根据需要修改、终止或暂停您的账户或服务的部分或全部。</p>
      <p>3.2 我们有权随时终止本协议，并有权拒绝您持续使用我们的服务。</p>
      <p>3.3 您可以随时关闭或终止您的账户。</p>
      <h2>免责条款</h2>
      <p>4.1 我们将尽力保护您的个人信息和数据安全，但无法保证绝对的安全性。</p>
      <p>4.2 您理解并同意我们不对因您使用我们的服务而引起的任何直接或间接损失承担责任。</p>
      <p>4.3 在适用法律允许的范围内，您同意免除我们及我们的关联公司、高级职员、董事、代理人和员工的责任。</p>
      <h2>法律适用</h2>
      <p>5.1 本协议受中华人民共和国的法律管辖。</p>
      <p>5.2 如发生任何本协议相关的争议，您同意将其提交至本协议管辖地的有管辖权的法院解决。</p>
    </div>
  </div>
</template>

<script>
export default {
  components: {},
  props: {},
  data() {
    return {};
  },
  watch: {},
  computed: {},
  methods: {},
  created() {},
  mounted() {}
};
</script>

<style lang="scss" scoped>
.agreement_page {
  background-image: url(../assets/img/协议背景.jpg);
  background-position: center;
  background-size: cover;
  width: 100vw;
  height: 100vh;
  overflow-wrap:break-word;
  .agreement_content{
    padding:30px;
  }
  h1{
    text-align: center;
  }
}
</style>
